cf/Catalogs/ЗаписиУО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЗаписиУО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УправленческаяОтчетность</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанныхУО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоРезультат</Name>
					<Comment>то что система считает автоматом</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияРезультата</Name>
					<Comment>0 - вручную; 1 - сумма подчиненных; 2 - Выражение; 3 - Источник</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияРезультатов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ЗаписиУО/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем стРезультат;

&НаКлиенте
Процедура ВидимостьРедактирования()
	
	Элементы.ДекорацияКорректировкаРезультата.Видимость = Объект.СпособПолученияРезультата И Объект.Результат <> Объект.АвтоРезультат;
	
КонецПроцедуры
&НаКлиенте
Процедура ВидимостьИстории()
	
	Если Объект.ИсторияРезультатов.Количество() Тогда
		
		Элементы.История.Видимость = Истина;
		
		Строка = Объект.ИсторияРезультатов[Объект.ИсторияРезультатов.Количество() - 1];
		
		Элементы.СтРезультат.Заголовок = Строка.Результат;
		Элементы.СтРезультат.Видимость = Строка.Результат <> Объект.Результат;
		
	Иначе
		
		Элементы.История.Видимость = Ложь; КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
	
	Элементы.Источник.Видимость = Объект.СпособПолученияРезультата = 3;
	Элементы.ГруппаВыражение.Видимость = Объект.СпособПолученияРезультата = 2;
	
	// Декорации
	
	Для Инд = 0 По 3 Цикл Элементы["Декорация" + Формат(Инд, "ЧН=0")].Видимость = Инд = Объект.СпособПолученияРезультата КонецЦикла;
	
	// Картинки
	
	Если 		Объект.СпособПолученияРезультата = 0 Тогда Элементы.КартинкаСпособа.Картинка = БиблиотекаКартинок.Ручка;
	ИначеЕсли 	Объект.СпособПолученияРезультата = 1 Тогда Элементы.КартинкаСпособа.Картинка = БиблиотекаКартинок.Сумма;
	ИначеЕсли 	Объект.СпособПолученияРезультата = 2 Тогда Элементы.КартинкаСпособа.Картинка = БиблиотекаКартинок.Формула;
	ИначеЕсли 	Объект.СпособПолученияРезультата = 3 Тогда Элементы.КартинкаСпособа.Картинка = БиблиотекаКартинок.Источник; КонецЕсли;
	
	// История
	
	ВидимостьИстории();
			
КонецПроцедуры

&НаКлиенте
Процедура СпособПолученияРезультатаПриИзменении(Элемент)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРедактирования();
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	
	ВидимостьРедактирования();
	ВидимостьИстории();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбранаИстория(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст("Когда: " + Формат(ВыбранныйЭлемент.Значение.Дата, "ДЛФ=DDT") + "
		|
		|Кем: " + ВыбранныйЭлемент.Значение.Пользователь + "
		|
		|Результат: " + ВыбранныйЭлемент.Значение.Результат);
		
		Текст.Показать("История " + Объект.Владелец + " " + Объект.Ссылка); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ДекорацияИсторияНажатие(Элемент)
	
	Список = Новый СписокЗначений;
	Для Каждого Строка Из Объект.ИсторияРезультатов Цикл Список.Вставить(0, Новый Структура("Дата, Пользователь, Результат", Строка.Дата, Строка.Пользователь, Строка.Результат), Формат(Строка.Дата,"ДЛФ=DDT") + " | " + Строка.Пользователь + " | " + Строка.Результат) КонецЦикла;
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВыбранаИстория", ЭтаФорма), Список, Элемент);
	
КонецПроцедуры


&НаСервере
Функция ВычислитьРезультатНаСервере()
	
	Результат = Справочники.ЗаписиУО.ПолучитьРезультат(КонвертацияТипов.ПолучитьСтруктуруИзОбъекта(РеквизитФормыВЗначение("Объект")), Объект.Владелец.ДатаНачала, КонецДня(Объект.Владелец.ДатаОкончания));
					
	Если Результат = Неопределено Тогда
			Возврат Ложь;
			
	Иначе 	Объект.Результат 		= Результат;
			Объект.АвтоРезультат 	= Результат; 
			Возврат Истина; КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура ПолучитьРезультат(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Сперва нужно сохранить",,"Ошибка результата");
	ИначеЕсли ВычислитьРезультатНаСервере() Тогда
		ВидимостьРедактирования();
		ВидимостьИстории(); КонецЕсли;
	
КонецПроцедуры
